
&Вместо("РезультатыВыполненияДляТипаДействия")
Функция ЕвченкоЧетвертаяКнопка_РезультатыВыполненияДляТипаДействия(ТипДействия)
	// Вставить содержимое метода.
	Результат = ПродолжитьВызов(ТипДействия);
	
	Если ТипДействия = ПредопределенноеЗначение("Перечисление.ТипыДействий.Согласование") И 
		ТипЗнч(Результат) = Тип("СписокЗначений") Тогда		
		Результат.Добавить(
		 	ПредопределенноеЗначение("Перечисление.РезультатыСогласования.ЧетвертаяКнопка"),
		 	НСтр("ru = 'Четвертая Кнопка'"));		
		КонецЕсли;
		
	Возврат Результат;
КонецФункции
