
&ИзменениеИКонтроль("ДанныеВариантовВыполненияЗадачи")
Функция ЕвченкоЧетвертаяКнопка_ДанныеВариантовВыполненияЗадачи(ДанныеДействияЗадачи, ВыделенныеДействия, ДанныеДляОбновления, МаксимальнаяДлинаОбщая, КешДанных)

	ДанныеВариантовВыполненияЗадачи = НовыеДанныеВариантовВыполненияЗадачи();

	// Рассчитаем вспомогательные данные.
	РезультатыОжидаемыхДействий = Новый Массив;
	КоличествоЗадачПоРезультатам = Новый Соответствие;
	ЗадачиПоРезультатам = Новый Соответствие;
	Для Каждого ВыделенноеДействие Из ВыделенныеДействия Цикл

		РеквизитыДействия = ДанныеДляОбновления.РеквизитыДействий[ВыделенноеДействие];

		ВидСостоянияУчастниковЗадач = РаботаСЗадачамиПовтИсп.ВидСостоянияУчастниковЗадач(
		РеквизитыДействия.СостояниеУчастникаЗадачи);
		Если Не Перечисления.ВидыСостоянийУчастниковЗадач.ЭтоОжидаемоеДействие(ВидСостоянияУчастниковЗадач) Тогда
			Продолжить;
		КонецЕсли;

		Если ДанныеДляОбновления.РеквизитыПодготовленыЗаранее Тогда
			ВидЗадачи = РеквизитыДействия.ВидЗадачи;
		Иначе
			КэшОбластиПросмотра = КэшиНаВремяВызоваПовтИсп.КэшЗадачаОбластьПросмотра();
			Если КэшОбластиПросмотра.Заполнен И КэшОбластиПросмотра.Задача = РеквизитыДействия.Задача Тогда
				ВидЗадачи = КэшОбластиПросмотра.ЗадачаОбъект.ВидЗадачи;
			Иначе
				ВидЗадачи = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыДействия.Задача, "ВидЗадачи");
			КонецЕсли;
		КонецЕсли;

		РезультатыВариантовВыполнения = РезультатыВариантовВыполнения(
		ВыделенноеДействие,
		ВидЗадачи,
		РеквизитыДействия.ВидДействия,
		КешДанных);

		Для Каждого КлючИЗначение Из РезультатыВариантовВыполнения Цикл

			РезультатВарианта = КлючИЗначение.Значение;

			РезультатыОжидаемыхДействий.Добавить(РезультатВарианта);

			Если КоличествоЗадачПоРезультатам[РезультатВарианта] = Неопределено Тогда
				КоличествоЗадачПоРезультатам[РезультатВарианта] = 0;
			КонецЕсли;
			КоличествоЗадачПоРезультатам[РезультатВарианта] = КоличествоЗадачПоРезультатам[РезультатВарианта] + 1;

			Если ЗадачиПоРезультатам[РезультатВарианта] = Неопределено Тогда
				ЗадачиПоРезультатам[РезультатВарианта] = Новый Массив;
			КонецЕсли;
			ЗадачиПоРезультатам[РезультатВарианта].Добавить(ВыделенноеДействие);

		КонецЦикла;

	КонецЦикла;

	РезультатыОжидаемыхДействий = ОбщегоНазначенияКлиентСервер.СвернутьМассив(РезультатыОжидаемыхДействий);

	СписокСортировки = Новый СписокЗначений;
	Для Каждого РезультатВарианта Из РезультатыОжидаемыхДействий Цикл
		СписокСортировки.Добавить(РезультатВарианта, Строка(РезультатВарианта));
	КонецЦикла;
	СписокСортировки.СортироватьПоПредставлению();
	РезультатыОжидаемыхДействий = СписокСортировки.ВыгрузитьЗначения();

	РеквизитыРезультатов = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(
	РезультатыОжидаемыхДействий,
	"ДоступноГрупповоеВыполнение");

	// Обновим кнопки вариантов в соответствии с текущим вариантом обзора.
	Если ДанныеДляОбновления.ДействиеУказано И ДанныеДляОбновления.РежимОдногоДействия Тогда

		// Обновим заголовки кнопок вариантов.
		РезультатыПоВариантам = Новый Соответствие;
		ВыделенноеДействие = ВыделенныеДействия[0];
		РеквизитыДействия = ДанныеДляОбновления.РеквизитыДействий[ВыделенноеДействие];

		ВидСостоянияУчастниковЗадач = РаботаСЗадачамиПовтИсп.ВидСостоянияУчастниковЗадач(
		РеквизитыДействия.СостояниеУчастникаЗадачи);
		Если Перечисления.ВидыСостоянийУчастниковЗадач.ЭтоОжидаемоеДействие(ВидСостоянияУчастниковЗадач) Тогда

			Если ДанныеДляОбновления.РеквизитыПодготовленыЗаранее Тогда
				ВидЗадачи = РеквизитыДействия.ВидЗадачи;
			Иначе
				КэшОбластиПросмотра = КэшиНаВремяВызоваПовтИсп.КэшЗадачаОбластьПросмотра();
				Если КэшОбластиПросмотра.Заполнен И КэшОбластиПросмотра.Задача = РеквизитыДействия.Задача Тогда
					ВидЗадачи = КэшОбластиПросмотра.ЗадачаОбъект.ВидЗадачи;
				Иначе
					ВидЗадачи = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(РеквизитыДействия.Задача, "ВидЗадачи");
				КонецЕсли;
			КонецЕсли;

			РезультатыВариантовВыполнения = РезультатыВариантовВыполнения(
			ДанныеДействияЗадачи,
			ВидЗадачи,
			РеквизитыДействия.ВидДействия);

			Для Каждого КлючИЗначение Из РезультатыВариантовВыполнения Цикл

				ВариантВыполнения = КлючИЗначение.Ключ;
				РезультатВарианта = КлючИЗначение.Значение;

				РезультатыПоВариантам[ВариантВыполнения] = РезультатВарианта;

			КонецЦикла;

		КонецЕсли;
		
		#Удаление
		Для ВариантВыполнения = 1 По 3 Цикл
			РезультатВарианта = РезультатыПоВариантам[ВариантВыполнения];
			Если РезультатВарианта = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ДанныеВариантовВыполненияЗадачи.ДоступныеРезультаты.Добавить(РезультатВарианта);
		КонецЦикла;
		#КонецУдаления
		
		#Вставка
		Для ВариантВыполнения = 1 По 4 Цикл
			РезультатВарианта = РезультатыПоВариантам[ВариантВыполнения];
			Если РезультатВарианта = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ДанныеВариантовВыполненияЗадачи.ДоступныеРезультаты.Добавить(РезультатВарианта);
		КонецЦикла;
		#КонецВставки

		ИнтеграцияЗадач.ПриОбновленииКнопокВариантовВыполнения(
		ДанныеДействияЗадачи,
		РеквизитыДействия.Источник,
		РезультатыПоВариантам,
		КешДанных,
		ДанныеВариантовВыполненияЗадачи);

		// Кнопки выполнения по шаблонам.
		ОбластьПрименения =
		ПараметрыВыбораРезультатаДействияТекстом(ДанныеДействияЗадачи).ОбластьПрименения;
		ШаблоныДляВыполнения = Справочники.ШаблоныТекстов.ШаблоныДляВыполнения(
		ОбластьПрименения,
		ДанныеВариантовВыполненияЗадачи.ДоступныеРезультаты);
		
		#Удаление
		КоличествоКнопокПоШаблонам = 3;
		#КонецУдаления
		#Вставка
		КоличествоКнопокПоШаблонам = 4;
		#КонецВставки
		КоличествоШаблонов = ШаблоныДляВыполнения.Количество();
		ОтображатьВыборШаблона =
		КоличествоКнопокПоШаблонам < КоличествоШаблонов И КоличествоШаблонов > 0;
		ДанныеВариантовВыполненияЗадачи.ВыбратьШаблонДляВыполненияЗадачиВидимость = ОтображатьВыборШаблона;
		Для Каждого ДанныеШаблона Из ШаблоныДляВыполнения Цикл
			ДанныеВариантовВыполненияЗадачи.ШаблоныДляВыбора.Добавить(
			ДанныеШаблона.Ссылка,
			ДанныеШаблона.Наименование);
		КонецЦикла;

	ИначеЕсли ДанныеДляОбновления.ДействиеУказано И Не ДанныеДляОбновления.РежимОдногоДействия Тогда

		ОчереднойНомерРезультата = 1;
		ЕстьНедоступныеВарианты = Ложь;
		НомераРезультатов = Новый Соответствие;
		Для Каждого РезультатВарианта Из РезультатыОжидаемыхДействий Цикл

			РеквизитыРезультата = РеквизитыРезультатов[РезультатВарианта];
			Если Не РеквизитыРезультата.ДоступноГрупповоеВыполнение Тогда
				ЕстьНедоступныеВарианты = Истина;
				Продолжить;
			КонецЕсли;

			НомерРезультата = НомераРезультатов[РезультатВарианта];
			Если НомерРезультата = Неопределено Тогда

				НомераРезультатов[РезультатВарианта] = ОчереднойНомерРезультата;

				ДанныеГрупповогоДействия = Новый Структура("Результат, Задачи, ВерсииДанных");
				ДанныеГрупповогоДействия.Результат = РезультатВарианта;
				ДанныеГрупповогоДействия.Задачи = ЗадачиПоРезультатам[РезультатВарианта];
				ДанныеГрупповогоДействия.ВерсииДанных = Новый Соответствие;
				Для Каждого Задача Из ДанныеГрупповогоДействия.Задачи Цикл
					ДанныеГрупповогоДействия.ВерсииДанных[Задача] =
					ДанныеДляОбновления.РеквизитыДействий[Задача].ВерсияДанных;
				КонецЦикла;
				ДанныеВариантовВыполненияЗадачи.ДанныеГрупповыхДействий.Добавить(ДанныеГрупповогоДействия);

				ОчереднойНомерРезультата = ОчереднойНомерРезультата + 1;

			Конецесли;

		КонецЦикла;

		ДанныеВариантовВыполненияЗадачи.ГруппаИнформацияПроОтрицательныеВидимость = ЕстьНедоступныеВарианты;

	КонецЕсли;

	// Отмена выполнения.
	ДанныеВариантовВыполненияЗадачи.ОтменитьВыполнениеВидимость =
	ДанныеДляОбновления.ДействиеУказано
	И ДанныеДляОбновления.РежимОдногоДействия
	И ДоступнаОтменаВыполнения(ДанныеДействияЗадачи, КешДанных);

	// Формируем возвращаемое значение.
	Если ДанныеДляОбновления.РежимОдногоДействия И ДанныеДляОбновления.ДействиеУказано Тогда
		ДанныеВариантовВыполненияЗадачи.ВерсияДанных = РеквизитыДействия.ВерсияДанных;
		ДанныеВариантовВыполненияЗадачи.ТекущийИсточникДействия = РеквизитыДействия.Источник;
	КонецЕсли;

	// Согласование в режиме замечаний.
	Если ТипЗнч(ДанныеДействияЗадачи) = Тип("СтрокаТаблицыЗначений") Тогда
		ИсточникДействияЗадачи = ИсточникДействияЗадачи(ДанныеДействияЗадачи);
	Иначе
		КэшОбластиПросмотра = КэшиНаВремяВызоваПовтИсп.КэшЗадачаОбластьПросмотра();
		Если КэшОбластиПросмотра.Заполнен И КэшОбластиПросмотра.ДействиеЗадачи = ДанныеДействияЗадачи Тогда
			ИсточникДействияЗадачи = КэшОбластиПросмотра.РеквизитыДействияЗадачи.Источник;
		Иначе
			ИсточникДействияЗадачи = ИсточникДействияЗадачи(ДанныеДействияЗадачи);
		КонецЕсли;
	КонецЕсли;

	Если ЗначениеЗаполнено(ИсточникДействияЗадачи)
		И ТипЗнч(ИсточникДействияЗадачи) = Тип("ЗадачаСсылка.ЗадачаИсполнителя") Тогда

		УстановитьПривилегированныйРежим(Истина);

		РеквизитыИсточника = Неопределено;
		Если КешДанных <> Неопределено И КешДанных.Свойство("ДанныеЗадачИсполнителей") Тогда
			РеквизитыИсточника = КешДанных.ДанныеЗадачИсполнителей[ИсточникДействияЗадачи];
		КонецЕсли;
		Если РеквизитыИсточника = Неопределено Тогда
			КэшОбластиПросмотра = КэшиНаВремяВызоваПовтИсп.КэшЗадачаОбластьПросмотра();
			Если КэшОбластиПросмотра.Заполнен И КэшОбластиПросмотра.ЗадачаПроцесса = ИсточникДействияЗадачи Тогда
				РеквизитыИсточника = КэшОбластиПросмотра.РеквизитыЗадачиПроцесса;
			Иначе
				РеквизитыИсточника = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
				ИсточникДействияЗадачи,
				"БизнесПроцесс, ТочкаМаршрута");
			КонецЕсли;
		КонецЕсли;

		СогласованиеВРежимеЗамечаний = Ложь;
		Если КешДанных <> Неопределено И КешДанных.Свойство("ДействиеПоПроцессу") Тогда
			Действие = КешДанных.ДействиеПоПроцессу[РеквизитыИсточника.БизнесПроцесс];
		Иначе
			Действие = РаботаСПроцессамиПоДействиям.ДействиеПоПроцессу(РеквизитыИсточника.БизнесПроцесс);
		КонецЕсли;
		Если ЗначениеЗаполнено(Действие) И ТипЗнч(Действие) = Тип("СправочникСсылка.ДействияСогласования") Тогда
			РеквизитыДействияОбработки = Неопределено;
			Если КешДанных <> Неопределено И КешДанных.Свойство("ДанныеДействий") Тогда
				РеквизитыДействияОбработки = КешДанных.ДанныеДействий[Действие];
			КонецЕсли;
			Если РеквизитыДействияОбработки <> Неопределено Тогда
				СогласованиеВРежимеЗамечаний = РеквизитыДействияОбработки.СогласованиеВРежимеЗамечаний;
			Иначе
				КэшОбластиПросмотра = КэшиНаВремяВызоваПовтИсп.КэшЗадачаОбластьПросмотра();
				Если КэшОбластиПросмотра.Заполнен И КэшОбластиПросмотра.ДействиеОбработки = Действие Тогда
					СогласованиеВРежимеЗамечаний =
					КэшОбластиПросмотра.РеквизитыДействияОбработки.СогласованиеВРежимеЗамечаний;
				Иначе
					СогласованиеВРежимеЗамечаний = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
					Действие,
					"СогласованиеВРежимеЗамечаний");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		ДанныеВариантовВыполненияЗадачи.ОсобаяОбработкаОткрытияФайлов = СогласованиеВРежимеЗамечаний;

	ИначеЕсли Не ЗначениеЗаполнено(ИсточникДействияЗадачи) Тогда

		Действие = Неопределено;
		Если ИнтеграцияЗадач.ЭтоЗадачаСогласованияВРежимеЗамечаний(ДанныеДействияЗадачи, Действие) Тогда
			СогласованиеВРежимеЗамечаний = Ложь;
			Если ЗначениеЗаполнено(Действие) И ТипЗнч(Действие) = Тип("СправочникСсылка.ДействияСогласования") Тогда
				РеквизитыДействияОбработки = Неопределено;
				Если КешДанных <> Неопределено И КешДанных.Свойство("ДанныеДействий") Тогда
					РеквизитыДействияОбработки = КешДанных.ДанныеДействий[Действие];
				КонецЕсли;
				Если РеквизитыДействияОбработки <> Неопределено Тогда
					СогласованиеВРежимеЗамечаний = РеквизитыДействияОбработки.СогласованиеВРежимеЗамечаний;
				Иначе
					СогласованиеВРежимеЗамечаний = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
					Действие,
					"СогласованиеВРежимеЗамечаний");
				КонецЕсли;
			КонецЕсли;
			ДанныеВариантовВыполненияЗадачи.ОсобаяОбработкаОткрытияФайлов = СогласованиеВРежимеЗамечаний;
		КонецЕсли;

	КонецЕсли;

	ДанныеВариантовВыполненияЗадачи.ДоступныКомандыВыполнения = ДанныеДляОбновления.ВсеДействияДоступны;

	Возврат ДанныеВариантовВыполненияЗадачи;

КонецФункции
