
&После("ЗаполнитьПоставляемыеДанные")
Процедура ЕвченкоЧетвертаяКнопка_ЗаполнитьПоставляемыеДанные()
	СостояниеУчастниковЗадачОбъект = ЧетвертаяКнопка.ПолучитьОбъект();
	СостояниеУчастниковЗадачОбъект.Наименование = НСтр("ru = 'Четвертая кнопка'");
	СостояниеУчастниковЗадачОбъект.ВидСостояния = Перечисления.ВидыСостоянийУчастниковЗадач.Выполнена;
	СостояниеУчастниковЗадачОбъект.РезультатДействия = Справочники.РезультатыДействийЗадач.ЧетвертаяКнопка;
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеЖенский = НСтр("ru = 'Четвертая кнопка'");
	СостояниеУчастниковЗадачОбъект.ТерминПереходаВСостояниеМужской = НСтр("ru = 'Четвертая кнопка'");
	ОбновлениеИнформационнойБазыДокументооборот.ЗаписатьДанные(СостояниеУчастниковЗадачОбъект);
КонецПроцедуры
