
&После("ЗаполнитьПоставляемыеДанные")
Процедура ЕвченкоЧетвертаяКнопка_ЗаполнитьПоставляемыеДанные()
	НаборСостоянийОбъект = Согласование.ПолучитьОбъект();
	СтрокаСостояния = НаборСостоянийОбъект.СостоянияУчастниковСовершено.Добавить();
	СтрокаСостояния.ВидУчастника = Справочники.ВидыУчастниковЗадач.Согласующий;
	СтрокаСостояния.РезультатДействия = Справочники.РезультатыДействийЗадач.ЧетвертаяКнопка;
	СтрокаСостояния.СостояниеУчастникаСовершено = Справочники.СостоянияУчастниковЗадач.ЧетвертаяКнопка;
	ОбновлениеИнформационнойБазыДокументооборот.ЗаписатьДанные(НаборСостоянийОбъект);
КонецПроцедуры
