
&Вместо("ПриДобавленииОбработчиковОбновления")
Функция ЕвченкоЧетвертаяКнопка_ПриДобавленииОбработчиковОбновления(Обработчики)
	
	//+++ЕАА-----------------------------------------------------------------------------------------
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "*";
	Обработчик.Процедура = "Справочники.РезультатыДействийЗадач.ЗаполнитьПоставляемыеДанные";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "*";
	Обработчик.Процедура = "Справочники.СостоянияУчастниковЗадач.ЗаполнитьПоставляемыеДанные";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "*";
	Обработчик.Процедура = "Справочники.НаборыСостоянийЗадач.ЗаполнитьПоставляемыеДанные";
	//---ЕАА-----------------------------------------------------------------------------------------
	
	Результат = ПродолжитьВызов(Обработчики);
	Возврат Результат;
КонецФункции
