
&После("ЗаполнитьПоставляемыеДанные")
Процедура ЕвченкоЧетвертаяКнопка_ЗаполнитьПоставляемыеДанные()
	РезультатДействийЗадачОбъект = ЧетвертаяКнопка.ПолучитьОбъект();
	РезультатДействийЗадачОбъект.Наименование = НСтр("ru = 'Четвертая кнопка'");
	РезультатДействийЗадачОбъект.ДоступноГрупповоеВыполнение = Ложь;
	РезультатДействийЗадачОбъект.ЗаголовокКоманды = НСтр("ru = 'Четвертая кнопка'");
	РезультатДействийЗадачОбъект.ХарактерРезультата = Перечисления.ХарактерыРезультатов.ПоложительныйСЗамечаниями;
	ОбновлениеИнформационнойБазыДокументооборот.ЗаписатьДанные(РезультатДействийЗадачОбъект);
КонецПроцедуры
